Load-Testing-E-Commerce/DAraz load test.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: login hrm-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: login hrm-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  login hrm-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1536,729)
      - go(https://opensource-demo.orangehrmlive.com/web/index.php/auth/login)
      - waitForByCSS(div.oxd-input-group__label-wrapper,Clickable): 10s
      - clickByCSS(div.oxd-input-group__label-wrapper)
      - waitForByName(username,Clickable): 10s
      - clickByName(username)
      - waitForByName(username,Clickable): 10s
      - typeByName(username): "A"
      - waitForByName(username,Clickable): 10s
      - typeByName(username): "Admin"
      - waitForByName(password,Clickable): 10s
      - clickByName(password)
      - waitForByCSS([data-v-10d463b7],Clickable): 10s
      - clickByCSS([data-v-10d463b7])
    - label: go to mu info 
      actions:
      - waitForByLinkText(My Info,Clickable): 10s
      - clickByLinkText(My Info)
      - waitForByLinkText(Job,Clickable): 10s
      - clickByLinkText(Job)
      - 'waitForByCSS(div:nth-of-type(4) .oxd-select-text-input,Clickable)': 10s
      - 'clickByCSS(div:nth-of-type(4) .oxd-select-text-input)'
    - label: logout
      actions:
      - waitForByCSS(span.oxd-userdropdown-tab,Clickable): 10s
      - clickByCSS(span.oxd-userdropdown-tab)
      - waitForByLinkText(Logout,Clickable): 10s
      - clickByLinkText(Logout)

  login hrm-Http:
    headers:
      sec-ch-ua: '"Google Chrome";v="143", "Chromium";v="143", "Not A(Brand";v="24"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      Upgrade-Insecure-Requests: '1'
      User-Agent: >-
        Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
        like Gecko) Chrome/143.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: >-
              https://opensource-demo.orangehrmlive.com/web/index.php/auth/validate
            method: POST
            label: >-
              https://opensource-demo.orangehrmlive.com/web/index.php/auth/validate
            think-time: 0ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              _token: >-
                a68c0.hA5NBQgTJrxJNkOMU2Z6xtqw8rR8WxHVuF80uzGb1GE.y08OSVArUuUeAXT8JAIApOnSgvAxPnO09w1k70jthzfuXnlkZEBWywhiKA
              password: admin123
              username: Admin
      - transaction: 'go to mu info '
        force-parent-sample: false
        do:
          - url: >-
              https://opensource-demo.orangehrmlive.com/web/index.php/pim/viewMyDetails
            method: GET
            label: >-
              https://opensource-demo.orangehrmlive.com/web/index.php/pim/viewMyDetails
            think-time: 17284ms
            headers: {}
          - url: >-
              https://opensource-demo.orangehrmlive.com/web/index.php/pim/viewJobDetails/empNumber/7
            method: GET
            label: >-
              https://opensource-demo.orangehrmlive.com/web/index.php/pim/viewJobDetails/empNumber/7
            think-time: 5718ms
            headers: {}
      - transaction: logout
        force-parent-sample: false
        do:
          - url: >-
              https://opensource-demo.orangehrmlive.com/web/index.php/auth/logout
            method: GET
            label: >-
              https://opensource-demo.orangehrmlive.com/web/index.php/auth/logout
            think-time: 22036ms
            headers: {}